# LINEAR REGRESSION

In [4]:
import matplotlib.pyplot as py
import seaborn as sb
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('PastHires.csv')
df.head(20)

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,10,Y,4,BS,N,N,Y
1,0,N,0,BS,Y,Y,Y
2,7,N,6,BS,N,N,N
3,2,Y,1,MS,Y,N,Y
4,20,N,2,PhD,Y,N,N
5,0,N,0,PhD,Y,Y,Y
6,5,Y,2,MS,N,Y,Y
7,3,N,1,BS,N,Y,Y
8,15,Y,5,BS,N,N,Y
9,0,N,0,BS,N,N,N
10,1,N,1,PhD,Y,N,N
11,4,Y,1,BS,N,Y,Y
12,0,N,0,PhD,Y,N,Y

In [6]:
df.replace({'Employed?':{'Y':1,'N':0},'Top-tier school':{'Y':1,'N':0},'Interned':{'Y':1,'N':0},'Hired':{'Y':1,'N':0}},inplace=True)
df.head()

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,10,1,4,BS,0,0,1
1,0,0,0,BS,1,1,1
2,7,0,6,BS,0,0,0
3,2,1,1,MS,1,0,1
4,20,0,2,PhD,1,0,0

In [7]:
loe = pd.get_dummies(df['Level of Education'],drop_first=True)
loe.sample(5)

    MS  PhD
0    0    0
8    0    0
2    0    0
1    0    0
10   0    1

In [8]:
df = pd.concat([df,loe],axis=1)
df.drop('Level of Education',inplace=True,axis=1)
df.head()

,Years Experience,Employed?,Previous employers,Top-tier school,Interned,Hired,MS,PhD
0,10,1,4,0,0,1,0,0
1,0,0,0,1,1,1,0,0
2,7,0,6,0,0,0,0,0
3,2,1,1,1,0,1,1,0
4,20,0,2,1,0,0,0,1

In [9]:
X=df[['Employed?','Previous employers','Top-tier school','Interned','Hired','MS','PhD']]
Y=df[['Years Experience']]

In [10]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.25,random_state=1)

In [11]:
model = LinearRegression()
model.fit(X_train,Y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [12]:
prediction=model.predict(X_test)
model.score(X,Y)

0.36931517597497043

# LOGISTIC REGRESSON

In [14]:
X1=df[['Years Experience','Employed?','Previous employers','Top-tier school','Interned','MS','PhD']]
Y1=df[['Hired']]
Y1 = np.ravel(Y1)
from sklearn.linear_model import LogisticRegression
X1_train,X1_test,Y1_train,Y1_test = train_test_split(X1,Y1,test_size=0.25,random_state=1)
model2=LogisticRegression()
model2.fit(X1_train,Y1_train)
prediction2 = model2.predict(X1_test)
print(prediction2)
model2.score(X1,Y1)

[1 1 1 1]

0.69230769230769229